betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_dma.c
    return bitstatus;
}

/*********************************************************************
 * @fn      DMA_ClearITPendingBit
 *
 * @brief   Clears the DMAy Channelx's interrupt pending bits.
 *
 * @param   DMAy_IT - specifies the DMAy interrupt source to check.
 *            DMA1_IT_GL1 - DMA1 Channel1 global flag.
 *            DMA1_IT_TC1 - DMA1 Channel1 transfer complete flag.
 *            DMA1_IT_HT1 - DMA1 Channel1 half transfer flag.
 *            DMA1_IT_TE1 - DMA1 Channel1 transfer error flag.
 *            DMA1_IT_GL2 - DMA1 Channel2 global flag.
 *            DMA1_IT_TC2 - DMA1 Channel2 transfer complete flag.
 *            DMA1_IT_HT2 - DMA1 Channel2 half transfer flag.
 *            DMA1_IT_TE2 - DMA1 Channel2 transfer error flag.
 *            DMA1_IT_GL3 - DMA1 Channel3 global flag.
 *            DMA1_IT_TC3 - DMA1 Channel3 transfer complete flag.
 *            DMA1_IT_HT3 - DMA1 Channel3 half transfer flag.
 *            DMA1_IT_TE3 - DMA1 Channel3 transfer error flag.
 *            DMA1_IT_GL4 - DMA1 Channel4 global flag.
 *            DMA1_IT_TC4 - DMA1 Channel4 transfer complete flag.
 *            DMA1_IT_HT4 - DMA1 Channel4 half transfer flag.
 *            DMA1_IT_TE4 - DMA1 Channel4 transfer error flag.
 *            DMA1_IT_GL5 - DMA1 Channel5 global flag.
 *            DMA1_IT_TC5 - DMA1 Channel5 transfer complete flag.
 *            DMA1_IT_HT5 - DMA1 Channel5 half transfer flag.
 *            DMA1_IT_TE5 - DMA1 Channel5 transfer error flag.
 *            DMA1_IT_GL6 - DMA1 Channel6 global flag.
 *            DMA1_IT_TC6 - DMA1 Channel6 transfer complete flag.
 *            DMA1_IT_HT6 - DMA1 Channel6 half transfer flag.
 *            DMA1_IT_TE6 - DMA1 Channel6 transfer error flag.
 *            DMA1_IT_GL7 - DMA1 Channel7 global flag.
 *            DMA1_IT_TC7 - DMA1 Channel7 transfer complete flag.
 *            DMA1_IT_HT7 - DMA1 Channel7 half transfer flag.
 *            DMA1_IT_TE7 - DMA1 Channel7 transfer error flag.
 *            DMA1_IT_GL8 - DMA1 Channel8 global flag.
 *            DMA1_IT_TC8 - DMA1 Channel8 transfer complete flag.
 *            DMA1_IT_HT8 - DMA1 Channel8 half transfer flag.
 *            DMA1_IT_TE8 - DMA1 Channel8 transfer error flag.
 *            DMA2_IT_GL1 - DMA2 Channel1 global flag.
 *            DMA2_IT_TC1 - DMA2 Channel1 transfer complete flag.
 *            DMA2_IT_HT1 - DMA2 Channel1 half transfer flag.
 *            DMA2_IT_TE1 - DMA2 Channel1 transfer error flag.
 *            DMA2_IT_GL2 - DMA2 Channel2 global flag.
 *            DMA2_IT_TC2 - DMA2 Channel2 transfer complete flag.
 *            DMA2_IT_HT2 - DMA2 Channel2 half transfer flag.
 *            DMA2_IT_TE2 - DMA2 Channel2 transfer error flag.
 *            DMA2_IT_GL3 - DMA2 Channel3 global flag.
 *            DMA2_IT_TC3 - DMA2 Channel3 transfer complete flag.
 *            DMA2_IT_HT3 - DMA2 Channel3 half transfer flag.
 *            DMA2_IT_TE3 - DMA2 Channel3 transfer error flag.
 *            DMA2_IT_GL4 - DMA2 Channel4 global flag.
 *            DMA2_IT_TC4 - DMA2 Channel4 transfer complete flag.
 *            DMA2_IT_HT4 - DMA2 Channel4 half transfer flag.
 *            DMA2_IT_TE4 - DMA2 Channel4 transfer error flag.
 *            DMA2_IT_GL5 - DMA2 Channel5 global flag.
 *            DMA2_IT_TC5 - DMA2 Channel5 transfer complete flag.
 *            DMA2_IT_HT5 - DMA2 Channel5 half transfer flag.
 *            DMA2_IT_TE5 - DMA2 Channel5 transfer error flag.
 *            DMA2_IT_GL6 - DMA2 Channel6 global flag.
 *            DMA2_IT_TC6 - DMA2 Channel6 transfer complete flag.
 *            DMA2_IT_HT6 - DMA2 Channel6 half transfer flag.
 *            DMA2_IT_TE6 - DMA2 Channel6 transfer error flag.
 *            DMA2_IT_GL7 - DMA2 Channel7 global flag.
 *            DMA2_IT_TC7 - DMA2 Channel7 transfer complete flag.
 *            DMA2_IT_HT7 - DMA2 Channel7 half transfer flag.
 *            DMA2_IT_TE7 - DMA2 Channel7 transfer error flag.
 *            DMA2_IT_GL8 - DMA2 Channel8 global flag.
 *            DMA2_IT_TC8 - DMA2 Channel8 transfer complete flag.
 *            DMA2_IT_HT8 - DMA2 Channel8 half transfer flag.
 *            DMA2_IT_TE8 - DMA2 Channel8 transfer error flag.
 *
 * @return  none
 */
void DMA_ClearITPendingBit(DMA_TypeDef* DMAx, uint32_t DMAy_IT)
{
    DMAx->INTFCR = DMAy_IT;
}

/*********************************************************************
 * @fn      DMA_MuxChannelConfig
 *
 * @brief   Configures the DMA input channel.
 *
 * @param   DMA_MuxChannelx - where x from 1 to 16 to select the Mux Channel.
 *          DMA_Requestx -  DMA request input.
 *                    This parameter must be a number between 1 and 0x7B.
 *
 * @return  none.
 */
void DMA_MuxChannelConfig(uint8_t DMA_MuxChannelx, uint32_t DMA_Requestx)
{
    if(DMA_MuxChannelx <= 3)
    {
        DMAMUX->CFGR0_3 &= ~(0x7F << (DMA_MuxChannelx * 8));
        DMAMUX->CFGR0_3 |= ((DMA_Requestx-1) << (DMA_MuxChannelx * 8));
    }
    else if((DMA_MuxChannelx >= 4) && (DMA_MuxChannelx <= 7))
    {
        DMAMUX->CFGR4_7 &= ~(0x7F << ((DMA_MuxChannelx - 4) * 8));
        DMAMUX->CFGR4_7 |= ((DMA_Requestx-1) << ((DMA_MuxChannelx - 4) * 8));
    }
    else if((DMA_MuxChannelx >= 8) && (DMA_MuxChannelx <= 11))
    {
        DMAMUX->CFGR8_11 &= ~(0x7F << ((DMA_MuxChannelx - 8) * 8));        
        DMAMUX->CFGR8_11 |= ((DMA_Requestx-1) << ((DMA_MuxChannelx - 8) * 8));
    }
    else if((DMA_MuxChannelx >= 12) && (DMA_MuxChannelx <= 15))
    {
        DMAMUX->CFGR12_15 &= ~(0x7F << ((DMA_MuxChannelx - 12) * 8));
        DMAMUX->CFGR12_15 |= ((DMA_Requestx-1) << ((DMA_MuxChannelx - 12) * 8));
    }
} 
